tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

tap "homebrew/cask-fonts"
cask "font-inconsolata-go-nerd-font"
cask "alacritty"
# brew "tmux" v3.3 is broked... manually installing for now https://github.com/tmux/tmux v3.2a

brew "git"
brew "git-lfs"
brew "tree"
cask "google-chrome"
cask "zoom"
cask "signal"
cask "joplin"
cask "spotify"
brew "watch"
cask "drawio"
cask "slack"
cask "discord"
brew "terraform"
brew "awscli"
brew "speedtest-cli"
brew "clamav"
cask "balenaetcher"
brew "smimesign"
brew "k9s"
cask "jetbrains-toolbox"
brew "nvm"
cask "obs"
brew "urlview"
brew "podman"
cask "hammerspoon"
cask "miro"
brew "kind"
brew "thefuck"
tap "weaveworks/tap"
brew "eksctl"
brew "skopeo"
cask "brave-browser"
brew "bat"

tap "fluxcd/tap"
brew "flux"
cask "docker"
brew "helm"
brew "kubectl"
brew "sops"
brew "kustomize"
brew "gnupg@2.2"
brew "k3d"
brew "jq"
brew "istioctl"

tap "norwoodj/tap"
brew "helm-docs"

tap "defenseunicorns/homebrew-tap"
brew "zarf"
