
# brew "adr-tools"
# brew "agg"
# brew "asciinema"
# brew "asdf"
# brew "aws-iam-authenticator" # dependency for eksctl, including here to get rid of annoying error message
# brew "eksctl"
# brew "grype"
# brew "opentofu"
# brew "oras"
# brew "typst"
# brew "watch"
# cask "crane"
# cask "discord"
# cask "drawio"
# cask "notion"
# cask "obs"
# cask "zoom"
# tap "weaveworks/tap"
brew "awscli"
brew "bat"
brew "gh"
brew "git"
brew "gnupg"
brew "k3d"
brew "kubectl"
brew "node"
brew "pre-commit"
brew "smimesign"
brew "tree"
brew "uds"
brew "yq"
brew "zsh"
cask "balenaetcher"
cask "google-chrome"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "notion"
cask "obsidian"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "windsurf"
tap "defenseunicorns/tap"
brew "yamllint"
cask "zed"
brew "opentofu"