tap "homebrew/bundle"
tap "homebrew/cask-versions"

tap "homebrew/cask-fonts"
cask "alacritty"
brew "tmux"

brew "git"
brew "git-lfs"
brew "tree"
cask "google-chrome"
cask "zoom"
cask "signal"
cask "spotify"
brew "watch"
cask "drawio"
cask "slack"
cask "discord"
brew "awscli"
brew "speedtest-cli"
brew "clamav"
cask "balenaetcher"
brew "smimesign"
brew "k9s"
cask "obs"
brew "urlview"
cask "hammerspoon"
brew "kind"
tap "weaveworks/tap"
brew "eksctl"
brew "aws-iam-authenticator" # dependency for eksctl, including here to get rid of annoying error message
brew "bat"
cask "visual-studio-code"
brew "asdf"

cask "docker"
brew "helm"
brew "kubectl"
brew "sops"
brew "kustomize"
brew "gnupg@2.2"
brew "k3d"
brew "jq"
brew "gh"

tap "norwoodj/tap"
brew "helm-docs"

tap "defenseunicorns/homebrew-tap"
brew "zarf"

brew "adr-tools"
cask "font-monaspace"
brew "typst"
brew "opentofu"
cask "android-studio"
brew "asciinema"
brew "agg"
brew "golangci-lint"
cask "obsidian"
brew "oras"
cask "notion"
brew "grype"
cask "crane"

tap "chainguard-dev/tap"
brew "chainguard-dev/tap/chainctl"

brew "pre-commit"
cask "windsurf"